[
{
"name":"St. Ignatius of Antioch",
"summary":" Born aroud the year 50 in Syria, Ignatius was an Apostolic Father of the Church, a disciple, with Saint Polycarp, of Saint John the Evangelist, and the third bishop of Antioch, the former See of Peter before he went to Rome. <br> In 117 he was sentenced to death by the Emperor Trajan and arrested in Antioch. He was brought, on a slow journey that lasted months, to the circus in Rome to be devoured by lions.  <br> During his months of captivity he wrote seven letters to Christian congregations in the Mediterranean, who he referred to generally as the 'Catholic' (universal) Church – thus coining the term for the first time. <br> His letters show him to have been a zealous pastor, with a fierce love for his flock and the Church universal, and he had no fear of martyrdom, rather, he welcomed it. His letter to the Romans is a jewel of Christian literature: <br> 'I am writing to all the churches to let it be known that I will gladly die for God if only you do not stand in my way. I plead with you: show me no untimely kindness. Let me be food for the wild beasts, for they are my way to God. I am God's wheat and bread. Pray to Christ for me that the animals will be the means of making me a sacrificial victim for God.'   <br> The prince of this world is determined to lay hold of me and to undermine my will which is intent on God. Let none of you here help him; instead show yourselves on my side, which is also God's side.'  <br> 'Believe instead what I am now writing to you. For though I am alive as I write to you, still my real desire is to die. My love of this life has been crucified, and there is no yearning in my for any earthly thing.'  <br> 'Rather within me is the living water which says deep inside me: 'Come to the Father.' I no longer take pleasure in perishable food or in the delights of this world I want only God's bread, which is the flesh of Jesus Christ, formed from the seed of David, and for drink I crave his blood, which is love that cannot perish.'  <br> 'Pray for me that I may obtain my desire. I have not written to you as a mere man would, but as one who knows the mind of God.' "
},
{
"name":"St. Iranaeus",
"summary":" Bishop of Lyons, and Father of the Church.<br>Information as to his life is scarce, and in some measure inexact. He was born in Proconsular Asia, or at least in some province bordering thereon, in the first half of the second century; the exact date is controverted, between the years 115 and 125, according to some, or, according to others, between 130 and 142. <br>It is certain that, while still very young, Irenaeus had seen and heard the holy Bishop Polycarp (d. 155) at Smyrna. During the persecution of Marcus Aurelius, Irenaeus was a priest of the Church of Lyons. The clergy of that city, many of whom were suffering imprisonment for the Faith, sent him (177 or 178) to Rome with a letter to Pope Eleutherius concerning Montanism, and on that occasion bore emphatic testimony to his merits. Returning to Gaul, Irenaeus succeeded the martyr Saint Pothinus as Bishop of Lyons. During the religious peace which followed the persecution of Marcus Aurelius, the new bishop divided his activities between the duties of a pastor and of a missionary (as to which we have but brief data, late and not very certain) and his writings, almost all of which were directed against Gnosticism, the heresy then spreading in Gaul and elsewhere. <br>In 190 or 191 he interceded with Pope Victor to lift the sentence of excommunication laid by that pontiff upon the Christian communities of Asia Minor which persevered in the practice of the Quartodecimans in regard to the celebration of Easter. Nothing is known of the date of his death, which must have occurred at the end of the second or the beginning of the third century. In spite of some isolated and later testimony to that effect, it is not very probable that he ended his career with martyrdom. His feast is celebrated on 28 June in the Latin Church, and on 23 August in the Greek. <br>Irenaeus wrote in Greek many works which have secured for him an exceptional place in Christian literature, because in controverted religious questions of capital importance they exhibit the testimony of a contemporary of the heroic age of the Church, of one who had heard St. Polycarp, the disciple of St. John, and who, in a manner, belonged to the Apostolic Age."
},
{
"name":"St.Polycarp",
"summary": "St.Polycarp was one of the immediate disciples of the Apostles, in particular St. John the Evangelist. He embraced Christianity very young and was named bishop of Smyrna. He was greatly respected by the faithful, wrote many letters and formed many holy disciples. His epistle to the Philippians - the only one to be preserved - demonstrates his apostolic spirit, his profound humility and meekness, and his great charity. <br>St. Polycarp fought against heresy. He also taught that Christians must walk in truth, do God’s will, keep all of His commandments, and love whatever He loved. Christians must refrain from all fraud, avarice, detraction, and rash judgment. They must repay evil with forgiveness and mercy. He taught that one must pray all the time, so as not to be led into temptation, fast, persevere and be joyful.<br>During his episcopate, a violent persecution broke out in Smyrna against the Christians. During this time, though fearless, the bishop retreated to a neighboring village, spending most of his time in prayer. <br>A boy betrayed the bishop, and horsemen came by night to arrest him. He met his captors at the door, ordered them a supper, and prayed for two hours before he went with them. <br>He was led directly to the proconsul, who ordered him to blaspheme Christ. St. Polycarp refused and he was to be burned alive. <br>The executioners would have nailed him to the stake, but he convinced them that it wasn’t necessary. So they simple tied his hands behind his back. At the end of his prayer, the executioners set the fire, but the large flames formed into an arch, gently encircling but not burning his body. Exasperated, officials ordered a spearman to pierce him. Such a quantity of blood flowed from his left side that it put out the fire. The Christians wanted St. Polycarp’s body but the centurion burnt it to ashes. The bones were kept as relics. "
},
{
"name":"St. Justin Martyr",
"summary":"'We are slain with the sword, but we increase and multiply; the more we are persecuted and destroyed, the more are deaf to our numbers. As a vine, by being pruned and cut close, shoots forth new suckers, and bears a greater abundance of fruit; so is it with us.' – St. Justin Martyr <br>Born in Flavia Neapolis (in Palestinian Syria) around 100; conversion to Christianity around 130; martyred in Rome in the year 165, under Marcus Aurelius.<br>Saint Justin Martyr (as he is commonly referred to) is the best known 2nd century Father of the Church. He was born a pagan, in a pagan region of what is now the Middle East, and was well, if ecclectically, educated in philosophy.<br> An avid lover of truth, he sought it through different philosophical schools, none of which satisfied his thirst, even though he was moved by the moral discipline of the Stoics and inspired by the speculative power of the Platonists.<br> At around the age of 30 he happened to cross paths with an old man walking along the beach who questioned him about his beliefs and especially about the sufficiency of philosophy as a means of attaining truth. This old man introduced him to Revelation and argued that although philosophers could talk about God, the Prophets, inspired by the Holy Spirit, had experienced and known God and could bring others to Him.<br> Justin had always admired Christians from a distance because of the beauty of their moral lives. As he writes in his Apologies: 'When I was a disciple of Plato, hearing the accusations made against the Christians and seeing them intrepid in the face of death and of all that men fear, I said to myself that it was impossible that they should be living in evil and in the love of pleasure.<br> He had been persuaded of the superiority of the Christian creed over all other beliefs and philosophies, and seen this belief made manifest in the witness of Christians who 'preferred truth to life.' Martyrdom was for him the highest proof of the truth of Christianity. Nobody, he said, died for the teaching of Socrates.<br> His his heart burned within him as he realized that he had finally found the Truth he had searched for all his life.<br> He became a Christian and a great apologist, engaging in debates and writing numerous works about the faith, most famously two apologetical treatises called 'Apologies' and 'Dialogue with Tryphon.'<br>  Following his conversion he taught school in Ephesus and in Rome, where in 165 he was condemned to death with six companions, Chariton, Charito, Evelpostos, Pæon, Hierax, and Liberianos during the persecution of Marcus Aurelius.<br>"

},
{
"name":"St. Athanasius",
"summary":"Athanasius was born in 295 in Alexandria, Egypt, and served there most of his whole life. He was ordained bishop of Alexandria in 328. <br> Three years earlier, he attended the Council of Nicea, where he defended the faith and the divinity of Jesus against Arianism, which was rampant at the time. He taught that Jesus was truly God and fully man, defining the Holy Spirit also as God. The Council was crucial to determining the orthodox teachings of the Church on the nature of Christ.He also fought for the acceptance of the Nicene Creed.  <br> As bishop, he took responsibility for the welfare of the desert monks and fathers. Due to the difficulties with politics and Arianism at the time, Athanasius was exiled five times, spending more than one-third of his episcopate in exile. <br> He died May 2, 373 at Alexandra. His relics are in Venice, Italy. "
},
{
"name":"St. Ambrose",
"summary":" Born around 340, Saint Ambrose served as the bishop of Milan from 374 to 397.  He is one of the four Great Latin Doctors of the Church, and is perhaps most famous for his role in the conversion of Saint Augustine. <br> Ambrose descended from an ancient and powerful Roman family, was educated by his mother and his sister after his father's death  He soon became well versed in Greek learning and philosophy, and studied law before being appointed governor of Milan by the Emperor. <br> He was a catechumen preparing for baptism when the bishop of Milan died in 374. A chaotic crowd formed outside the cathedral to elect a bishop, and Ambrose, who had gone out to the crowd to quieten them down, was unanimously acclaimed bishop of Milan after a child cried out 'Ambrose for bishop! Ambrose for bishop!' <br> He was thus baptized, confirmed, ordained a deacon, a priest, and then a bishop all on the same day. Ambrose was famous for his sermons and his teaching, especially on the sacraments, and it was his sublime preaching and holiness that captured the attention of the young Saint Augustine. <br> He died April 4, 397, in Milan."
},
{
"name":"St. Cyril of Jerusalem",
"summary":"Born 315 A.D.  Died 386 A.D.  Bishop of Jerusalem and Doctor of the Church. <br> In the East his feast is observed on the 18th of March, in the West on the 18th or 20th. Little is known of his life. We gather information concerning him from his younger contemporaries, Epiphanius, Jerome, and Rufinus, as well as from the fifth-century historians, Socrates, Sozomen and Theodoret. Cyril himself gives us the date of his 'Catechesis' as fully seventy years after the Emperor Probus, that is about 347, if he is exact. Constans (d. 350) was then still alive. St. Jerome relates (Chron. ad ann. 352) that Cyril had been ordained priest by St. Maximus, his predecessor, after whose death the episcopate was promised to Cyril by the metropolitan, Acacius of Caesarea, and the other Arian bishops, on condition that he should repudiate the ordination he had received from Maximus. He consented to minister as deacon only, and was rewarded for this impiety with the see. Maximus had consecrated Heraclius to succeed himself, but Cyril, by various frauds, degraded Heraclius to the priesthood. So says St. Jerome; but Socrates relates that Acacius drove out St. Maximus and substituted St. Cyril. A quarrel soon broke out between Cyril and Acacius, apparently on a question of precedence or jurisdiction. At Nicaea the metropolitan rights of Caesarea had been guarded, while a special dignity had been granted to Jerusalem. Yet St. Maximus had held a synod and had ordained bishops. This may have been as much as the cause of Acacius' enmity to him as his attachment to the Nicene formula. On the other hand, Cyril's correct Christology may have been the real though veiled ground of the hostility of Acacius to him. At all events, in 357 Acacius caused Cyril to be exiled on the charge of selling church furniture during a famine. Cyril took refuge with Silvanus, Bishop of Taraus. He appeared at the Council of Seleucia in 359, in which the semi-Arian party was triumphant. Acacius was deposed and St. Cyril seems to have returned to his see. But the emperor was displeased at the turn of events, and, in 360, Cyril and other moderates were again driven out, and only returned at the accession of Julian in 361. In 367, a decree of Valens banished all the bishops who had been restored by Julian, and Cyril remained in exile until the death of the persecutor in 378. In 380, St. Gregory of Nyssa came to Jerusalem on the recommendation of a council held at Antioch in the preceding year. He found the Faith in accord with the truth, but the city a prey to parties and corrupt in morals. St. Cyril attended the great Council of Constantinople in 381, at which Theodosius had ordered the Nicene faith, now a law of the empire, to be promulgated. St. Cyril then formally accepted the homoousion; Socrates and Sozomen call this an act of repentance. Socrates gives 385 for St. Cyril's death, but St. Jerome tells us that St. Cyril lived eight years under Theodosius, that is, from January 379."
},
{
"name":"St. Clement of Rome",
"summary":"Lived in the 1st century A.D.  Died 100 A.D.  He is believed to have been the fourth bishop of Rome and served during the last decade of the first century. Around 96, he sent a letter from the Church of Rome to the Church of Corinth, a major city in northeastern Greece and the site of St. Paul's evangelization. This letter, known as Clement's First Epistle to the Corinthians, is most likely directed against immoral practices of prostitution connected with the Temple of Aphrodite. In the letter, Clement expresses his dissatisfaction with events taking place in the Corinthian Church and asks the people to repent for their un-Christian ways. The letter is important because it indicates that the author was acting as the head of the Christian Church and that it was centered in Rome. Clement was allegedly put to death under Emperor Domitian."
},
{
"name":"St. Augustine",
"summary":"Augustine was born at the town of Tagaste (now Souk-Ahras, in modern day Algeria) on November 13, 354. He grew to become one the most significant and influential thinkers in the history of the Catholic Church, and his teachings were the foundation of Christian doctrine for a millennium. <br> The story of his life, up until his conversion, is written in the autobiographical Confessions, the most intimate and well known glimpse into an individual's soul ever written, as well as a fascinating philosophical, theological, mystical, poetic and literary work. <br> He was the first son of Saint Monica and a pagan father named Patricius, who was baptized just before his death, leaving his mother the widow whose tears and prayers for the conversion of her wayward son are known to us through the Confessions. <br> Augustine, though being brought up in early childhood as a Christian, delayed being baptized, lived a dissolute life of revelry and sin, and soon drifted away from the Church - thinking that he wasn't necessarily leaving Christ, of whose name he acknowledges 'I kept it in the recesses of my heart; and all that presented itself to me without that Divine name, though it might be elegant, well written, and even replete with truth, did not altogether carry me away' (Confessions, I, iv). <br> He went to study in Carthage and became well known in the city for his brilliant mind and rhetorical skills and sought a career as an orator or lawyer. But he also discovered and fell in love with philosophy at the age of 19, a love he pursued with great vehemence. <br> He was attracted to Manichaeanism at this time, after its devotees had promised him that they had scientific answers to the mystery of nature, could disprove the Scriptures, and could explain the problem of evil. Augustine became a follower for nine years, learning all there was to learn in it before rejecting it as incoherent and fraudulent. <br> He went to Rome and then Milan in 386 where he met Saint Ambrose, the bishop and Doctor of the Church, whose sermons inspired him to look for the truth he had always sought in the faith he had rejected. He received baptism and soon after, his mother, Saint Monica, died with the knowledge that all she had hoped for in this world had been fulfilled. <br> He returned to Africa, to his hometown of Tagaste, 'having now cast off from himself the cares of the world, he lived for God with those who accompanied him, in fasting, prayers, and good works, meditating on the law of the Lord by day and by night.' <br> On a visit to Hippo he was proclaimed priest and then bishop against his will. He accepted it as the will of God and spent the rest of his life as the pastor of this north African town, from where he spent much time refuting the writings of heretics.  Augustine also wrote, The City of God, against the pagans who charged that the fall of the Roman empire, which was taking place at the hands of the Vandals. <br> On August 28, 430, as Hippo was under siege by the Vandals, Augustine died, at the age of 76. His legacy continues to deeply shape the face of the Church to this day. "
},
{
"name":"St. Jerome",
"summary":"Saint Jerome,  one of the four great Latin Doctors of the Church (the other three being St. Ambrose, St. Augustine, and St. Gregory the Great), was the pre-eminent scholar and translator of Sacred Scripture in the history of the Church. He was the translator of the Vulgate version of the Bible. <br> St. Jerome was born in Dalmatia around 340-342 AD.  Having grown up a wealthy pagan, Jerome visited Rome at about 20 and was converted and baptized. He went to study theology in the famous schools of Trier, and later set out to the Syrian desert in order to live as a hermit. He was ordained a priest in Antioch and at the age of 40 he went to Constantinople, where he met and befriended St. Gregory of Nazianzus (one of the four great Greek Doctors of the Church). <br> He became the secretary of Pope Damasus, who commissioned the Vulgate from him, which took him 30 years to write. His harsh temperament and his biting criticisms of his intellectual opponents made him many enemies in the Church and in Rome and he was forced to leave the city. <br> Jerome went to Bethlehem, established a monastery, and lived the rest of his years in study, prayer, and ascetcism. Jerome died at Bethlehem, September 30th, 420.  He is the patron of Bible scholars. <br> St. Jerome once said, 'I interpret as I should, following the command of Christ: 'Search the Scriptures,' and 'Seek and you shallfind.' For if, as Paul says, Christ is the power of God and the wisdom of God, and if the man who does not know Scripture does not know the power and wisdom of God, then ignorance of Scriptures is ignorance of Christ.'"
},
{
"name":"St. Gregory the Great",
"summary":"Pope Saint Gregory I, commonly known as St. Gregory the Great, was one of the most fascinating of early Church leaders.  Son of a Roman Senator, Saint Gregory was born in Rome around 540AD and, following his dad's footsteps, embarked upon a political career.  He rose through the ranks of civil service and eventually became Prefect (mayor) of the city of Rome.  At that point, Gregory discerned a call to deeper life with God so promptly gave away his wealth to the poor and entered the monastery of St. Andrew (ca. 574) where he ultimately became abbot (585).  The Pope, recognizing his talent, named him as one of the seven deacons of Rome and then sent him on a diplomatic mission as papal legate to the imperial city of Constantinople where he remained for five years.  Upon the death of the pope in 590, St. Gregory was elected to succeed him, the first monk ever elected as the Successor of Peter. <br> This man who wanted nothing else but to be a simple monk had to undergo a profound interior struggle before accepting this election as the will of God.  Immediately he set to work putting in order the affairs of a Church and society in chaos.  Like his predecessor Pope Leo the Great, he negotiated a 'separate peace' with the invading barbarians, in this case the Lombards (592-3).  In light of the powerlessness of the Byzantine emperor in the West, he took over civic as well as spiritual leadership of Italy, appointing governors of the various Italian cities.  He, who had spent his own wealth to relieve the suffering of the poor, did much the same with the resources of the church.   He insisted on Papal primacy, and took the initiative in evangelization, sending monks from his former monastery led by Augustine to convert the Angles of Britain. <br> His abundant writings are more practical and spiritual than doctrinal or theoretical.  His 'Liber Regulae Pastoralis' (592 ca) sets the standard of what a bishop should be.  His 'Dialogues' recounts the life of his master, St. Benedict, and other saints of the period.  His Moralia in Job is a commentary on the book of Job according to the literal, moral, and spiritual senses of Scripture.  Very devoted to the liturgy, Gregory promoted sacred music and to this day the plainsong that comes down to us from this era is known as 'Gregorian Chant.'  Gregory, who died in 604 AD, is known as one of the four greatest Latin-speaking Fathers and Doctors of the Church.  He is one of the few men in the history of the Church whose name is customarily followed by 'the Great.'  His liturgical memorial is on September 3, the anniversary of his consecration as bishop of Rome and successor of St. Peter.  His favorite title for this exalted office was 'servant of the servants of God.'"
},
{
"name":"St. John Chrysostom",
"summary": "St. John Chrysostom, one of the greatest Early Church Fathers of the 5th Century, was born around 347 AD.  St. John became a monk and was ordained a priest to serve the Church in Antioch where his eloquent preaching on the Sacred Scriptures earned him the title of 'Chrysostom,' meaning golden-mouthed.'  In 398, Chrysostom was called upon to assume the responsibilities of the Patriarch Archbishop of Constantinople,much to his chagrin.  This reluctant patriarch nevertheless fulfilled his duty with extraordinary energy and courage.  St. John Chrysostom's call to repentance and moral reform won him the emnity of the nominally Christian Empress who had him deposed and exiled on trumped-up charges.  But his preaching and intrepid boldness inspired the hearts of the people of Constantinople who held him in great affection.  His devotion to the written Word of God was matched by a love of the Eucharist and of divine worship.  To this day, the principal 'Byzantine' liturgy celebrated by most Slavic, Greek, and middle-eastern Christians is known as the Liturgy of St. John Chrysostom.  St. John Chysostom, who died under the harsh conditions of his exile in 407, will always be remembered as one of the greatest of the Early Church Fathers and one of the greatest preachers of all time.  His beautiful but always practical bible teaching has earned St. John Chrysostom the title 'Doctor of the Church.' "
},
{
"name":"St. Origen",
"summary":"Origen, born into a Christian family from Alexandria Egypt around 185AD, was only a teenager when he witnessed his father, Leonidas, dragged from his home by Roman soldiers and ultimately martyred.  He was inspired by his father's heroic example to dedicate himself to a strict life of prayer, fasting and study.  The bishop of Alexandria, Demetrius, recognized the talent and holiness of this young man and named him head of the catechetical school of this great center of early Christianity.  Origen ultimately became one of the greatest Scripture scholars and preachers of the early Church.  Though he began his teaching ministry as a lay catechist, Origen was ultimately ordained a priest and wrote commentaries and homilies that influenced subsequent Early Church Fathers from both East and West.  Though he did not receive the grace of martyrdom, Origen was imprisoned and brutally tortured for his faith during the persecution that took place under the emperor Decius.  Weakened by his ordeal, he died a few years later in 254 AD. <br> Though several of Origen's teachings were condemned after his death by Church authorities, it must be remembered that his erroneous opinions were expressed in matters that had not yet been defined by official Church teaching.  In his lifetime, Origen was always a loyal son of the Church whose correct opinions far outnumbered his errors. <br> Origen's writings were profuse indeed, though only a limited number survive.  He wrote commentaries on almost every book of the Bible, with his treatise on Song of Songs, Romans, and many homilies on the Pentateuch (the first five books of the Old Testament) surviving either intact or in large portions.  He was the author of one of the earliest attempts at textual criticism of the Old Testatment, the Hexapla, and was responsible for the first attempt at systematic theology in his famous De Principiis (On First Principles).  His two works of spiritual theology, Exhortation to Martyrdom and On Prayer were widely read in the Early Church and are still read today, with many excerpts used in the Roman Office of Readings."
},
{
"name":"St. Ephrem the Syrian",
"summary":"St. Ephrem (also spelt Ephraem) the Syrian was a deacon who wrote his reflections almost exclusively in poetry, in the Syriac Aramaic language which was a dialect of the same language spoken by Our Lord and the apostles.  He lived for most of his life in the city of Edessa, and wrote with such beauty on so many topics that he is regarded as one of the Doctors of the Church.  Saint Ephrem died in the year 373 AD.  His emphatic insistence on the absolute sinlessness of the Virgin Mary makes him an early witness of the Church's belief in Mary's Immaculate Conception."
},
{
"name":"St. Leo the Great",
"summary":"Life of St. Leo the Great: It is regrettable that so little is known about the early life of this man who proved to be such an extraordinary shepherd of the Catholic Church that he came to be known not only as Pope Saint Leo I, but also is one of the only two Popes in two thousand years to be called 'the Great.'  What we do know is that as a deacon of the Roman Church, before being elevated to the office of Pope in 440 AD, St. Leo the Great had opposed the heresy of Pelagianism which taught that grace was not necessary for salvation, but was rather a bonus that God granted to those who earned it by their good works.  As Pope, St. Leo the Great was forceful and unambiguous in his Christological teaching which affirmed the full divinity and humanity of Christ.  In fact his most famous writing, commonly known as the Tome of St. Leo (449), was the basis of the Council of Chalcedon's (451) dogmatic definition of Christ as one Divine Person possessing two complete natures, human and divine. <br> St. Leo the Great was Pope during the middle of the fifth century, a troubled time when barbarian armies were ravaging the once mighty Roman Empire.  For all intents and purposes, the Western Empire was in total political and military collapse and there was a vacuum of political leadership.  Pope St. Leo filled the void and became the advocate for the temporal as well as spiritual needs of his flock.  He is perhaps most famous for persuading Attila the Hun to abandon his plans to sack the city of Rome and to withdraw his forces beyond the Danube river (452).  St. Leo once again was the spokesperson for the Roman citizenry in 455 when the Vandal barbarians swept into Central Italy, securing concessions from them.  <br> Through both his powerful teaching and his leadership, Pope St. Leo the Great very much strengthened the office of the Papacy and made a strong biblical case for the Divine institution of this ministry by examining the biblical evidence for Peter's unique role among the apostles.  <br> The writings that survive by St. Leo, besides his famous Tome, consist of 143 letters and 96 sermons.  His sermons cover every season of the liturgical year and are indeed a treasure.  Excerpts from these letters and sermons are included below to you a taste of this man's clear and vigorous way of preaching and teaching the faith passed down from the apostles.  St. Leo the Great died in 461, is regarded as one of the most important of the Western Fathers of the Church and was declared a 'Doctor of the Church' by Pope Benedict XIV. "
}


]