[
    {
        "name": " FIRST COUNCIL OF NICAEA ",
        "year": " 325",
        "summary": "At issue was the claim by the Egyptian priest, Arius, that the Son of God was a created being and not therefore fully divine. This heresy was refuted by the assembled bishops, who declared that the Father and Son were of one substance, 'consubstantial' - or, in Greek, 'homoousios'. <br> The definitional decree of the council which condemned the teaching of Arius did not altogether end the controversy. Some of the bishops had reservations over the use of a non-scriptural term (i.e. homoousios) and the Greek word itself was capable of different interpretations which might be taken to imply that the Father and Son were numerically one. This resulted in several decades of ongoing theological dispute between an almost solidly Nicene Latin West and the more wide ranging opinions in the Eastern Church.",
        "furtherreading": "https://en.wikipedia.org/wiki/First_Council_of_Nicaea"
    },
    {
        "name": " FIRST COUNCIL OF CONSTANTINOPLE",
        "year": " 381",
        "summary": "The Emperor Theodosius called a further council, this time in Constantinople, in order to confirm the 'Nicene Faith' and to add the important proviso that the Holy Spirit is also equal and divine in the Trinity. This council produced a creed, which is still described today as the 'Nicene Creed' (although technically it should be the Niceno - Constantinopolitan creed), and has been used down the centuries at Masses on Sundays and Solemnities and contains the authentic teaching on the Trinity.",
        "furtherreading": "https://en.wikipedia.org/wiki/First_Council_of_Constantinople"
    },
    {
        "name": " COUNCIL OF EPHESUS",
        "year": " 431",
        "summary": "Having established the teaching on the Trinity, a third Ecumenical Council was convened at Ephesus in 431 to confront Nestorianism. This heresy was named after Nestorius, the bishop of Constantinople (428-431), who was accused of over- emphasising the distinction between the divine and the human in Christ, that He could be considered to be two persons making it heretical to describe Mary as Theotokos, God bearer, as she gave birth to a man, Jesus, in whom God dwells. The council affirmed the unity of Christ by recognising that the correct title for the Mary was indeed 'Theotokos' - Mother of God, and in due course a definitional formula was agreed to present Christ as one person with two natures.<br> As at Nicea more than a century before, the teaching of the Ephesus council did not totally end the controversy. Nestorians went their own way but new divisions arose over the manner in which the divine and human natures were united in Christ and these eventually developed into Monophysitism, which held that although there may have been two natures before the incarnation of the Son, there was only one nature afterwards.",
        "furtherreading": "https://en.wikipedia.org/wiki/First_Council_of_Ephesus"
    },
    {
        "name": " COUNCIL OF CHALCEDON",
        "year": " 451",
        "summary": "A further council was called, therefore, at Chalcedon in 451 which condemned both of the above heresies and formalised the doctrine of the 'Hypostatic Union', namely the union of two distinct natures of God and man in the person of Jesus Christ who is true God and true man. The council statement to a large extent, owed much to the foundation of faith which was presented by Pope St. Leo I, (440-461) and which the assembled prelates had judged to be in harmony with the teachings of earlier councils. Pope St Leo’s significance in this matter requires study as some historian’s have perhaps overstressed papal involvement, whereas the ’Formula of Union’ of 433 was also of considerable importance. ",
        "furtherreading": "https://en.wikipedia.org/wiki/Council_of_Chalcedon"
    },
    {
        "name": " SECOND COUNCIL OF CONSTANTINOPLE",
        "year": " 553",
        "summary": "The Council again dealt with the issue of the two natures of Christ, as monophysitism had spread through Christianity despite the decisions of Chalcedon. The Council met from May 5 until June 2, 553 in eight sessions during the pontificate of Pope Vigilius, who was imprisoned during the Council by the emperor. It condemned 'Three Chapters' of Nestorian writings. Several Catholic provinces refused to accept the Second Council of Constantinople because of the political pressures",
        "furtherreading": "https://en.wikipedia.org/wiki/Second_Council_of_Constantinople"
    },
    {
        "name": " THIRD COUNCIL OF CONSTANTINOPLE",
        "year": " 680-681",
        "summary": "The Council repudiated Monothelitism, and reaffirmed that Christ, being both human and divine, had both human and divine wills. It met in sixteen sessions from November 7, 680 until September 16, 681. The Council was held during the pontificates of Pope Agatho and Pope Leo II. It also discussed the views of Honorius.",
        "furtherreading": "https://en.wikipedia.org/wiki/Third_Council_of_Constantinople"
    },
    {
        "name": " SECOND COUNCIL OF NICAEA",
        "year": " 787",
        "summary": "In 730, the emperor outlawed pictorial presentations of Christ and the saints and created thus the first iconoclasm. The Pope argued against it and convened in 731 a local council in Rome to no avail.[9] The council discussed and restored of the veneration of icons using the Bible and tradition of the Church as arguments. Pictures of Christ, the Blessed Virgin Mary and the Saints were used to stimulate piety and imitation. The Council met in eight sessions from September 24, 787 until October 23, 787 during the pontificate of Pope Hadrian I. It issued twenty canons. This was the last Ecumenical Council to be accepted by both Eastern and Western churches.",
        "furtherreading": "https://en.wikipedia.org/wiki/Second_Council_of_Nicaea"
    },
    {
        "name": " FOURTH COUNCIL OF CONSTANTINOPLE",
        "year": " 869",
        "summary": "With the coronation of Charlemagne by Pope Leo III in 800, his new title as Patricius Romanorum, and the handing over of the keys to the Tomb of Saint Peter, the papacy had acquired a new protector in the West. This freed the pontiffs to some degree from the power of the emperor in Constantinople, but it also led to a schism, because the emperors and patriarchs of Constantinople interpreted themselves as the true descendants of the Roman Empire dating back to the beginnings of the Church. Pope Nicholas I had refused to recognize Patriarch Photios I of Constantinople, who in turn had attacked the pope as a heretic, because he kept the filioque in the creed, which referred to the Holy Spirit emanating from God the Father and the Son. The Council condemned Photius, who questioned the legality of the papal delegates presiding over the Council and ended the schism. The Council met in ten sessions from October 869 to February 870 and issued 27 canons.",
        "furtherreading": "https://en.wikipedia.org/wiki/Fourth_Council_of_Constantinople_(Catholic)"
    },
    {
        "name": " FIRST LATERAN COUNCIL",
        "year": " 1123",
        "summary": "The first Lateran Council ratified the right of the Church as opposed to monarchs or nobles to invest bishops with the insignia of office.",
        "furtherreading": "https://en.wikipedia.org/wiki/First_Council_of_the_Lateran"
    },
    {
        "name": " SECOND LATERAN COUNCIL",
        "year": " 1139",
        "summary": "Lateran II introduced compulsory celibacy for clerics from sub-deacon upwards and declared that the marriage of a cleric was not only unlawful but also invalid.",
        "furtherreading": "https://en.wikipedia.org/wiki/Second_Council_of_the_Lateran"
    },
    {
        "name": " THIRD LATERAN COUNCIL",
        "year": " 1179",
        "summary": "This Council brought to an end the power struggle between the papacy and the German king, Barbarossa, laid down the voting procedure for the election of the pope and set agreed qualitative requirements for the ordination of bishops. These first three Lateran Councils were judged to be ecumenical; they were mainly disciplinary but they dealt with matters pertinent to the church as a whole. The subject matter, however, was not as critical as the earlier Trinitarian and Christological councils concerned with essential doctrine. They are also seen as a prelude to the Fourth Lateran Council.",
        "furtherreading": "https://en.wikipedia.org/wiki/Third_Council_of_the_Lateran"
    },
    {
        "name": " FOURTH LATERAN COUNCIL",
        "year": " 1215",
        "summary": "This Council was called by Pope Innocent III in 1215 and included formal invitations to Eastern bishops. Lateran IV, was forced to confront and condemn the Cathar, or Albigensian, heresy with its aversion to all things of the flesh, which by implication would include a rejection of Christ's incarnation, of marriage and of the resurrection of the flesh. The council also produced decrees for the minimum annual reception of the sacraments of penance and communion. It required bishops of large dioceses to appoint teachers to help them fulfil their preaching responsibilities, and sought to end abuses involving relics. Unfortunately, the overall positive record of Lateran IV was tarnished by the inclusion of several anti-semitic canons. The date 1215 recalls the contemporary event of Magna Carta at Runnymede by the River Thames.",
        "furtherreading": "https://en.wikipedia.org/wiki/Fourth_Council_of_the_Lateran"
    },
    {
        "name": " FIRST COUNCIL OF LYONS",
        "year": " 1245",
        "summary": "The thirteenth Ecumenical Council was held in Lyons in 1245 with the chief subject being the conflict between the pope and German emperor, although some canons were agreed involving reforms of the clergy.",
        "furtherreading": "https://en.wikipedia.org/wiki/First_Council_of_Lyon"
    },
    {
        "name": " SECOND COUNCIL OF LYONS",
        "year": " 1274",
        "summary": "A second council of Lyons was opened in 1274 by Pope Gregory X (the finally chosen candidate for election following a three year selection debate by the cardinals) with invitations extended to abbots, cathedral chapters, representatives of orders of knights, kings, princes and the Eastern Emperor, Michael VIII Paleologous. During the course of the council, an act of union which acknowledged the primacy of the popes was agreed with the Greek Church but this was ultimately rejected by the overwhelming majority of the Greek hierarchy.",
        "furtherreading": "https://en.wikipedia.org/wiki/Second_Council_of_Lyon"
    },
    {
        "name": " COUNCIL OF VIENNE",
        "year": " 1311-1313",
        "summary": "The next council, the fifteenth, took place in Vienne, South of Lyons, effectively at the prompting of the French king (Pope Clement V was French) and with only a selected number of bishops present. The principal item on the agenda was to secure the condemnation and suppression of the Knights Templar which had become a powerful and wealthy religious order whose assets had been targeted by Philip of France. Vienne marked the beginning of a long 'exile' from Rome. ",
        "furtherreading": "https://en.wikipedia.org/wiki/Council_of_Vienne"
    },
    {
        "name": " COUNCIL OF CONSTANCE",
        "year": " 1414-1418",
        "summary": "That calling of a council to resolve difficulties relating to the papacy was a high risk exercise as it could be taken to imply the supremacy of a council over a pope. This is exactly what happened at Constance with the passing two decrees; Sacrosancta which proclaimed the supremacy of the council over the pope, and Frequens calling for future councils to be held at regular intervals. On positive note, the assembled cardinals elected Martin V as pope for the whole church in succession to the Roman Pontiff (Gregory XII) who had resigned in 1415 and in place of the two other rivals, thereby bringing the schism to an end. The council itself closed in 1418, but it had introduced a form of organisational thinking called conciliarism. Conciliarism contends that a Council is superior to a pope. However, in conformity with the decree Frequens Pope Martin V called a council at Pavia five years later but this was so poorly attended that it was quickly closed.",
        "furtherreading": "https://en.wikipedia.org/wiki/Council_of_Constance"
    },
    {
        "name": " COUNCIL OF BASLE/FERRARA/FLORENCE",
        "year": " 1431-1439",
        "summary": "The council continued debate on councilarism. The papal delegate opened the Council in Basel on July 23, 1431 without a single bishop present. When he tried to close it later, bishops insisted of citing the pope to the Council, which he refused. The Council continued on its own and issued several decrees on Church reform. Most of the participants were theologians, bishops made only ten percent of the eligible voters. The Pope moved the council to Ferrara, where he achieved a major success, when the Greek Orthodox Church agreed to unity with Rome. But councilarism continued to be the politically correct trend, as 'reform' and 'council' were seen as inseparable. Formally, the Council of Basel was never closed. The council decreed in 1439 (a short-lived) union with Greek, Armenian, and Jacobite Churches (1442). The Council had 25 sessions from July 1431 until April 1442 It met under Pope Eugene IV in Basel, Germany, and Ferrara and Florence Italy. It was moved to Rome in 1442.",
        "furtherreading": "https://en.wikipedia.org/wiki/Council_of_Florence"
    },
    {
        "name": " FIFTH LATERAN COUNCIL",
        "year": " 1512-1517",
        "summary": "The eighteenth general Council was called by Pope Julius II in 1512 in response to a decision two years earlier by the French King to call his own council on the grounds that the papacy on its own was unable to reform the church. Julius's council was held at the Lateran in Rome and the predominantly Italian bishops in attendance sought and received support from most European monarchs in condemning the French king's council. <br> Lateran V did pass a number of reform measures but many serious ongoing abuses appeared to have been ignored, confirming the worst fears of some conciliarists. In the event, this last council of the late medieval period can be seen to have achieved too little too late as within six months of its closure Martin Luther had posted his 95 Theses at Wittenberg, proposing a different approach to church reform. The Protestant Reformation had begun, although - certainly after The Emperor Charles V had met Luther at Worms (1521) - had Rome been more perceptive and active, the ultimate splits of the sixteenth century might have been averted. There was another important meeting between Catholics and Protestants at Worms (1540-1), which made some progress in reconciliation, but the calling of the Council of Trent (1545-63) was further delayed and Christian Unity received a further blow.",
        "furtherreading": "https://en.wikipedia.org/wiki/Fifth_Council_of_the_Lateran"
    },
    {
        "name": " COUNCIL OF TRENT",
        "year": " 1545-1563",
        "summary": "The council issued condemnations on what it defined as Protestant heresies and defined Church teachings in the areas of Scripture and Tradition, Original Sin, Justification, Sacraments, the Eucharist in Holy Mass and the veneration of saints. It issued numerous reform decrees.[26] By specifying Catholic doctrine on salvation, the sacraments, and the Biblical canon, the Council was answering Protestant disputes.[27] The Council entrusted to the Pope the implementation of its work, as a result of which Pope Pius V issued in 1566 the Roman Catechism, in 1568 a revised Roman Breviary, and in 1570 a revised Roman Missal, thus initiating the Tridentine Mass (from the city's Latin name Tridentum), and Pope Clement VIII issued in 1592 a revised edition of the Vulgate.<br> The Council of Trent is considered one of the most successful councils in the history of the Catholic Church. It defined Church beliefs maintained today. It convened in Trent between December 13, 1545, and December 4, 1563 in twenty-five sessions for three periods. Council fathers met for the 1st–8th session in Trent (1545–1547), for the 9th–11th session in Bologna (1547) during the pontificate of Pope Paul III. Under Pope Julius III, the council met in Trent (1551–1552) for the 12th–16th session. Under Pope Pius IV the 17th–25th session took place in Trent (1559–1565).",
        "furtherreading": "https://en.wikipedia.org/wiki/Council_of_Trent"
    },
    {
        "name": " FIRST VATICAN COUNCIL",
        "year": " 1869-1870",
        "summary": "The Council was convened by Pope Pius IX in 1869 and had to be prematurely interrupted in 1870 because of advancing Italian troops. In the short time, it issued definitions of the Catholic faith, the papacy and the infallibility of the Pope. Many issues remained incomplete, such as a definition of the Church. Many French Catholics wished the dogmatization of Papal infallibility and the assumption of Mary in the ecumenical council. During Vatican One, nine mariological petitions favoured a possible assumption dogma, which however was strongly opposed by some council fathers, especially from Germany. On May 8, the fathers rejected a dogmatization at that time, a rejection shared by Pope Pius IX. The concept of Co-Redemptrix was also discussed but left open. In its support, Council fathers highlighted the divine motherhood of Mary and called her the mother of all graces. The council met in four sessions from December 8, 1869 to July 18, 1870",
        "furtherreading": "https://en.wikipedia.org/wiki/First_Vatican_Council"
    },
    {
        "name": " SECOND VATICAN COUNCIL",
        "year": " 1962-1965",
        "summary": "The Second Vatican Council was invoked by Pope John XXIII. It met from 1962 to 1965. Unlike most previous councils, this one did not discuss heresy as its orientation was mainly pastoral; The Council called for a renewal of the Roman rite of liturgy 'according to the pristine norm of the Fathers' and a popularization of the Gregorian chant, pastoral decrees on the nature of the Church and its relation to the modern world, restoration of a theology of communion, promotion of Scripture and Biblical studies, pastoral decrees on the necessity of ecumenical progress towards reconciliation with other Christian churches. <br> The general sessions of the Council were held in the autumns of four successive years (in four periods) 1962 through 1965. During the rest of the year special commissions met to review and collate the work of the bishops and to prepare for the next period. Sessions were held in Latin in St. Peter's Basilica, with secrecy kept as to discussions held and opinions expressed. Speeches (called interventions) were limited to ten minutes. Much of the work of the council, though, went on in a variety of other commission meetings (which could be held in other languages), as well as diverse informal meetings and social contacts outside of the council proper. <br> Two-thousand nine-hundred and eight (2,908) men (referred to as Council Fathers) were entitled to seats at the council. These included all bishops from around the world, as well as many superiors of male religious orders. 2,540 took part in the opening session, making it the largest gathering in any council in church history. (This compares to Vatican I where 737 attended, mostly from Europe.) Attendance varied in later sessions from 2,100 to over 2,300. In addition, a varying number of periti (Latin for 'experts') were available for theological consultation—a group that turned out to have a major influence as the council went forward. Seventeen Orthodox Churches and Protestant denominations sent observers. More than three dozen representatives of other Christian communities were present at the opening session, and the number grew to nearly 100 by the end of the 4th Council Session.",
        "furtherreading": "https://en.wikipedia.org/wiki/Second_Vatican_Council"
    }
]