[
	{"name":"St Agatha","born":"231", "died":"251", "feast":"Feb-05","canonized": "By tradition confirmed by Gregory I", "comments": "She was martyred  in around 251 at Sicily. She is one of seven women, who along with Blessed Virgin Mary, are commemorated by name in the Canon of the Mass." },
	{"name":"St Agnes", "born":"291", "died":"304", "feast":"Jan-21", "canonized":"Pre-congregation","comments":"She is a virgin-martyr. She is one of seven women, who along with Blessed Virgin Mary, are commemorated by name in the Canon of the Mass."},
	{"name":"St Albert the Great", "born":"1193", "died":"1280", "feast":"Nov-15", "canonized":"1931 by Pope Pius XI","comments":"He was a German Dominican friar and a Catholic bishop. He is one of only 36 , Doctor of the catholic Church."},
	{"name":"St Alphonsus Liguori", "born":"1696", "died":"1787", "feast":"Aug-01", "canonized":"1839 by Pope Gregory XVI","comments":"He was an Italian Catholic Bishop, spiritual writer, scholastic philosopher and theologian.His best known works are The Glories of Mary and The Way of the Cross."},
	{"name":"St Ambrose", "born":"340", "died":"397", "feast":"Dec-07", "canonized":"Pre-congregation","comments":"He was a bishop of Milan who became one of the most influential ecclesiastical figures of the 4th Century. Confessor and Doctor of the Catholic Church."},
	{"name":"St Anselm", "born":"1033", "died":"1109", "feast":"Apr-21", "canonized":"1494 by Pope Alexander VI","comments":"He was a Benedictine monk, abbot, philosopher and theologian of the Catholic Church. Archibishop of Canterbury from 1093 to 1109."},
	{"name":"St Anthony of Egypt", "born":"251", "died":"356", "feast":"Jan-17", "canonized":"Pre-congregation","comments":"He is known as the Father of All Monks. Venerable and God-bearing , Father of Monasticism."},
	{"name":"St Anthony of Padua", "born":"1195", "died":"1231", "feast":"Jun-13", "canonized":"1232 by Pope Gregory IX","comments":"He was born and raised by a wealthy family in Lisbon and died in Padua, Italy, He was proclaimed a Doctor of the Church on 16 January 1946. He is a patron saint of finding things or lost people."},
	{"name":"St Athanasius", "born":"295", "died":"373", "feast":"May-02", "canonized":"Pre-congregation","comments":"He was Bishop of Alexandria during 328 to 373 AD, of which over 17 years were spent in five exiles ordered by four different Roman emperors."},
	{"name":"St Augustine", "born":"354", "died":"430", "feast":"Aug-28", "canonized":"Pre-congregation","comments":"He was Bishop of Hippo(modern-day Annaba, Algeria). He is viewed as one of the most important Early Church Fathers. His most important works are The City of God and Confessions. "},
	{"name":"St Basil the Great", "born":"329", "died":"379", "feast":"Jan-02", "canonized":"Pre-congregation","comments":"He was Greek Bishop of Caesarea Mazaca in Cappadocia,Asia Minor(modern-day Turkey). He was an influential theologian who supported the Nicene Creed and opposed the heresies of the early Christian Church(namely, Arianism)."},
	{"name":"St Bede the Venerable", "born":"673", "died":"735", "feast":"May-25", "canonized":"1899 in Rome by Pope Leo XIII","comments":"He was an English monk and an author and scholar. His famous work  is Historia ecclesiastica gentis Angiorum(The Ecclesiastical History of English People) ; Doctor of the Church."},
	{"name":"St Benedict", "born":"480", "died":"543", "feast":"Jul-11", "canonized":"1220 in Rome by Pope Honorius","comments":"Abbot;Patron of Europe. His main achievement is his Rule of Saint Benedict, containing precepts for his monks. He is often called the founder of western monasticism."},
	{"name":"St Bernard of Clairvaux", "born":"1090", "died":"1153", "feast":"Aug-20", "canonized":"1174, by Pope Alexander III","comments":"He was a French Abbot and the primary builder of the reforming Cistercian order. In 1830 Pope Pius VIII bestowed upon him the title Doctor of the Church."},
	{"name":"St Bernadette Soubirous", "born":"1844", "died":"1879", "feast":"Apr-16", "canonized":"1933, by Pope Pius XI","comments":"She was a daughter of  a miller from Lourdes, France, and is venerated as a  mystic saint in the Church. She is best known for  the Marian apparitions of a 'small young lady' who asked for a chapel to be built at the nearby garbage dump of the cave grotto at Massabielle where apparitions are said to have occurred between Feb 11 and July 16,1858."},
	{"name":"St Blaise", "born":"", "died":"316", "feast":"Feb-03", "canonized":"Pre-congregation","comments":"He was a physician and Bishop of Sebastea in historical Armenia(Modern-day Sivas, Turkey). He is the patron saint of wool combers as well as sufferers from throat diseases."},
	{"name":"St Bonaventure", "born":"1221", "died":"1274", "feast":"Jul-15", "canonized":"1482, by Pope Sixtus IV","comments":"Friar, Bishop, Doctor of the Church. He was an Italian medieval scholastic theologian. He is known as the Seraphic Doctor."},
	{"name":"St Boniface", "born":"675", "died":"754", "feast":"Jun-05", "canonized":"not sure","comments":"He was a leading figure in the Anglo-Saxon mission to the Germanic parts of the Frankish Empire during the 8th Century.He is regarded as a unifier of Europe"},
	{"name":"St Bridget of Sweden", "born":"1303", "died":"1373", "feast":"Jul-23", "canonized":"1391, by Pope Boniface IX","comments":"She was a mystic and saint, and founder of the Bridgettines nuns and monks. She was also known as the Princess of Nericia. At the age of ten, she had a vision of Jesus hanging upon the cross. When she asked who had treated him like this, he answered: They who despise me, and spurn my love for them."},
	{"name":"St Catherine of Siena", "born":"1347", "died":"1380", "feast":"Apr-29", "canonized":"1461, by Pope Pius II","comments":"She was a tertiary of the Dominican Order and a Scholastic philosopher and theologian. She also worked to bring the papacy of Gregory XI back to Rome from its displacement in France. In 1970, she was proclaimed as Doctor of the Church."},
	{"name":"St Cecilia", "born":"2C", "died":"230", "feast":"Nov-22", "canonized":"","comments":"She is the patroness of musicians. She is one of seven women, excluding the Blessed Virgin commemorated by name in the Canon of the Mass.Virgin and Martyr."},
	{"name":"St Charles Borromeo", "born":"1538", "died":"1584", "feast":"Nov-04", "canonized":"1610, by Paul V","comments":"He was a cardinal who was archbishop of Milan from 1564 to 1584.He , with St Ignatius of Loyola and St Philip Neri, and others, led the movement to combat the inroads of the Protestant Reformation."},
	{"name":"St Clare of Assisi", "born":"1194", "died":"1253", "feast":"Aug-11", "canonized":"1255, by Pope Alexander IV","comments":"Founder of Order of Poor Ladies , a monastic religious order for women in the Franciscan tradition."},
	{"name":"St Clement of Rome", "born":"1C", "died":"99", "feast":"Nov-23", "canonized":"Pre-congregation","comments":"Pope Clement I , also known as Saint Clement of Rome is listed by Irenaeus and Tertullian as Bishop of Rome. He is considered to be the first Apostolic Father of the Church."},
	{"name":"St Cornelius", "born":"2C", "died":"253", "feast":"Sep-16", "canonized":"Pre-congregation","comments":"He was the Bishop of Rome from 251 to his martyrdom in 253. St Cornelius name  means battle horn, and he is represented in icons by a pope either holding some form of cow's horn ow with a cow nearby."},
	{"name":"St Cosmas and Damian", "born":"3C", "died":"287", "feast":"Sep-26", "canonized":"Pre-congregation","comments":"They were reputed twin brothers, physicians and early christian martyrs. Accepting no payment for their services led to them being named Anarguroi(Unmercenaries); it has been said that, by this they attracted many to the Christian faith."},
	{"name":"St Cyprian", "born":"210", "died":"258", "feast":"Sep-16", "canonized":"Pre-congregation","comments":"He was bishop of Carthage(present-day Tunisia). His skillful Latin rhetoric led to his being considered the pre-eminent Latin writer of Western Christianity until Jerome and Augustine."},
	{"name":"St Cyril of Alexandria", "born":"376", "died":"444", "feast":"Jun-27", "canonized":"Pre-congregation","comments":"He was the Patriarch of Alexandria from 412 to 444. He was a central figure in the First Council of Ephesus in 431. He is counted among the Church Fathers and the Doctors of the Church"},
	{"name":"St Cyril of Jerusalem", "born":"313", "died":"386", "feast":"Mar-18", "canonized":"Pre-congregation","comments":"He succeeded Maximus as Bishop of Jerusalem, but was exiled on more than one occasion due to the enmity of Acacius of Caesarea and the policies of various emperors. He left important writings documenting the instruction of catechumens and the order of the Liturgy in his day."},
	{"name":"St Damasus I", "born":"305", "died":"384", "feast":"Dec-11", "canonized":"Pre-congregation","comments":"He was Pope from 366 to 384. He was active in defending the Catholic Church against the threat of schisms. In two Roman synods(368 and 369) he condemed Apollinarianism and Macedonianism, and sent legates to the First Council of Constantinople that was convoked in 381 to address these heresies."},
	{"name":"St Dominic", "born":"1170", "died":"1221", "feast":"Aug-08", "canonized":"In 1234 AD.","comments":"Spanish priest and founder of the Dominican Order. He is the patron saint of astronomes."},
	{"name":"St Dominic Savio", "born":"1842", "died":"1857", "feast":"May-06", "canonized":"1954, by Pope Pius XII","comments":"He was an Italian adolescent student of Saint John Bosco. He was studying to be a priest when be became ill and died at the age of 14, possibly from pleurisy."},
	{"name":"St Elizabeth Ann Seton", "born":"1774", "died":"1821", "feast":"Jan-04", "canonized":"1975, by Pope Paul VI","comments":"She was the first native-born citizen of the United States to be canonized by the Church. She founded the first American congregation of religious sisters , the Sisters of Charity."},
	{"name":"St Ephrem", "born":"306", "died":"373", "feast":"Jun-09", "canonized":"Pre-congregation","comments":"He was a Syriac deacon and prolific Syriac-language hymnographer and theologian of the 4th century from the region of Syria.Confessor and Doctor of the Church."},
	{"name":"St Eusebius of Vercelli", "born":"283", "died":"371", "feast":"Aug-02", "canonized":"Pre-congregation","comments":"He was a Bishop in Italy. Along with Athanasius, he affirmed the divinity of Jesus against Arianism."},
	{"name":"St Francis Xavier Cabrini", "born":"1850", "died":"1917", "feast":"Nov-13", "canonized":"1946, by Pope Pius XII","comments":"She was Italian-American religious sister, who founded the Missionary Sisters of the Sacred Heart. She was the first naturalized citizen of the United States to be canonized by the Church."},
	{"name":"St Francis de Sales", "born":"1567", "died":"1622", "feast":"Jan-24", "canonized":"1665, by Pope Alexander VII","comments":"He was a Bishop of Geneva and Doctor of the Church, noted for his deep faith and his gentle approach to the religious divisions in his land resulting from Protestant Reformation.He is known also for his writings, particularly the Introduction to the Devout Life and the Treatise on the Love of God."},
	{"name":"St Francis of Assisi", "born":"1181", "died":"1226", "feast":"Oct-04", "canonized":"1228, by Pope Gregory IX","comments":"He was an Italian Catholic friar and preacher, nicknamed Francesco. He founded the men's Order of Friars Minor, the women's Order of St Clare and the Third Order of Saint Francis. He is one of the most venerated religious figures in history."},
	{"name":"St Francis of Paola", "born":"1416", "died":"1507", "feast":"Apr-02", "canonized":"1519, by Pope Leo X","comments":"He was an Italian mendicant friar and the founder of the Order of Minims. Like his patron saint, Francis was never ordained a priest."},
	{"name":"St Francis Xavier", "born":"1506", "died":"1552", "feast":"Dec-03", "canonized":"1622, by Pope Gregory XV","comments":"He was a missionary, born in Xavier, Kingdom of Navarre(now part of Spain), and a co-founder of Society of Jesus. He was a companion of St. Ignatius of Loyola. He is known as Apostle to the Far East."},
	{"name":"St Gertrude the Great", "born":"1256", "died":"1302", "feast":"Nov-16", "canonized":"1677, by Clement XII","comments":"She was a German Benedictine, mystic and theologian. She produced numerous writings, though only some survive today. The Herald of Divine Love is one of her writings. Philip Neri and Francis de Sales both used her prayers and recommended them to others."},
	{"name":"St Gregory of Nazianzus", "born":"329", "died":"390", "feast":"Jan-02", "canonized":"Pre-congregation","comments":"He was also known as Gregory the Theologian, 4th century Archibishop of Constantinople.He made a significant impact on the shape of Trinitarian theology.Along with the brothers Basil the Great and Gregory of Nyssa, he is known as one of the Cappadocian Fathers."},
	{"name":"St Gregory of Nyssa", "born":"335", "died":"395", "feast":"Jan-10", "canonized":"Pre-congregation","comments":"He was Bishop of Nyssa from 372 to 376 and from 378 until his death. He is known as Cappadocian Fathers along with his elder brother Basil and his friend Gregory of Nazianzus. He made significant contributions to the doctrine of the Trinity and the Nicene creed."},
	{"name":"St Gregory the Great", "born":"540", "died":"604", "feast":"Sep-03", "canonized":"by popular acclaim.","comments":"Pope Gregory I , commonly known as Saint Gregory the Great. He is known as St Gregory the Dialogist because of his Dialogues. He is a Doctor of the Church and he was the first of the popes to come from a monastic background."},
	{"name":"St Henry", "born":"973", "died":"1024", "feast":"Jul-13", "canonized":"1147, by Pope Bl. Eugenius III","comments":"Henry II is known as Saint Henry. He was the last member of the Ottonian dynasty of Emperors . He supported service to the Church and promoted various monastic reforms. He succeeded in persuading Pope Benedict VIII to include the word Filioque (meaning Holy Spirit emanated from both God the Father and God the Son) in the Nicene Creed. "},
	{"name":"St Hilary of Poitiers", "born":"310", "died":"367", "feast":"Jan-13", "canonized":"Pre-congregation","comments":"He was Bishop of Poitiers and is a Doctor of the Church. He was sometimes referred to as the Hammer of the Arians and the Athanasius of the West."},
	{"name":"St Ignatius of Antioch", "born":"35", "died":"107", "feast":"Oct-17", "canonized":"Pre-congregation by John The Apostle","comments":"He was an Apostolic Father and the third bishop of Antioch. He was a student of John the Apostle. En route to Rome, where he met his martyrdom by being fed to wild beasts.The word catholic (from greek katholikos) was used by Ignatius in his letter to the Smyrnaeans in about the year 107."},
	{"name":"St Ignatius of Loyola", "born":"1491", "died":"1556", "feast":"Jul-31", "canonized":"1622, by Gregory XV","comments":"He was a Spanish knight from a noble family, hermit, priest since 1537 and theologian, who founded the Society of Jesus. He emerged as a religious leader during the Counter-Reformation."},
	{"name":"St Irenaeus", "born":"130", "died":"202", "feast":"Jun-28", "canonized":"Pre-congregation","comments":"He was Bishop of Lugdunum in Gaul, then a part of the Roman Empire(now Lyon,France). He was an early Church Father and apologist and his writings were formative in the early development of Christian theology.His best-known book Adversus Haereses or Against Heresies, is a detailed attack on Gnosticism. He was a hearer of Polycarp who is a discipleof John the Evangelist."},
	{"name":"St Isidore of Seville", "born":"560", "died":"636", "feast":"Apr-04", "canonized":"1598, by Pope Clement VIII","comments":"He was Bishop of Seville for more than three decades. He played a prominent role in the Councils of Toledo and Seville. He practically eradicated the heresy of Arianism and completely stifled the new heresy of Acephali at its very outset. In the year 1722 , Pope Innocent XII declared him a Doctor of the Church. "},
	{"name":"St Jeanne Jugan", "born":"1792", "died":"1879", "feast":"Aug-30", "canonized":"2009, by Pope Benedict XVI","comments":"She is known as Sister Mary of the Cross, was a French woman who became known for the dedication of her life to the needest of the elderly poor.Her service resulted in the establishment of the Little Sisters of the Poor."},
	{"name":"St Jerome", "born":"347", "died":"420", "feast":"Sep-30", "canonized":"Pre-congregation","comments":"He was a Catholic Priest, Confessor, theologian and historian, who also became a Doctor of the Church. He is best known for his translation of most of the Bible into Latin(known as the Vulgate) and his commentaries on the Gospels."},
	{"name":"St Joan of Arc", "born":"1412", "died":"1431", "feast":"May-30", "canonized":"1920, by Pope Benedict XV","comments":"Savior of France and the national heroine of that country. Priests and former playmates then recalled her love of prayer and faithful attendance at church, her frequent use of the Sacraments, kindness to sick people and sympathy for poor wayfarers, to whom she sometimes gave up her own bed."},
	{"name":"St John Bosco", "born":"1815", "died":"1888", "feast":"Jan-31", "canonized":"1934, by Pius XI","comments":"Popularly known as Don Bosco , was an Italian Priest , educator and writer of the 19th Century.He developed teaching methods based on love rather than punishment, a method that became known as Salesian Preventive System. A follower of the spirituality and philosophy of Saint Francis de Sales and he founded the Salesians of Don Bosco."},
	{"name":"St John Chrysostom", "born":"349", "died":"407", "feast":"Sep-13", "canonized":"Pre-congregation","comments":"He was Archbishop of Constantinople, an important Early Church Father. He is known for his preaching and public speaking, his Divine Liturgy and his ascetic sensibilities. Doctor of the Church"},
	{"name":"St John of Damascus", "born":"675", "died":"749", "feast":"Dec-04", "canonized":"Pre-congregation","comments":"He is also known as John Damascene, was a Syrian monk and priest. He is sometimes called the last of the Church Fathers and was declared a Doctor of the Church by Pope Leo XIII."},
	{"name":"St John Neumann", "born":"1811", "died":"1860", "feast":"Jan-05", "canonized":"1977, by Pope Paul VI","comments":"He was a native of Bohemia who immigrated to the United States, where he became a Catholic priest of the Redemptorist order and the fourth Bishop of Philadelphia. He is the first American Bishop to be canonized."},
	{"name":"St John of the Cross", "born":"1542", "died":"1591", "feast":"Dec-14", "canonized":"1726, by Pope Benedict XIII","comments":"He was a major figure of the Counter-Reformation, a Spanish mystic, a Carmelite friar and a priest who was born at Fontiveros Old Castile.He was a reformer of the Carmelite Order , and is considered along with St. Teresa of Avila, as a founder of the Discalced Carmelites. Doctor of the Church."},
	{"name":"St John Paul II", "born":"1920", "died":"2005", "feast":"Oct-22", "canonized":"2014, by Pope Francis","comments":"He served as Pope from 1978 to 2005. He is recognised as helping to end Communist rule in his native Poland and eventually all of Europe. Supported the Church's Second Vatican Council and its reforms. He was one of the most travelled world leaders in history, visiting 129 countries during his pontificate."},
	{"name":"St John Vianney", "born":"1786", "died":"1859", "feast":"Aug-04", "canonized":"1925, by Pope Pius XI","comments":"He was a French parish priest who is patron saint of all priests. He is often referred to as the Cure d'Ars. Because of his pastoral work , he brought radical spiritual transformation in his community and its surroundings. "},
	{"name":"St John XXIII", "born":"1881", "died":"1963", "feast":"Oct-11", "canonized":"2014, by Pope Francis","comments":"He served as Pope from 1958 to his death in 1963. He called the historic Second Vatican Council(1962-65) but did not live to see the Vatican Council to completion."},
	{"name":"St Juan Diego", "born":"1474", "died":"1548", "feast":"Dec-09", "canonized":"2002, by Pope John Paul II","comments":"He is the first saint from the Americas , a native of Mexico. He is said to have been granted an apparition of Virgin Mary on four separate occasions at the hill of Tepeyac(present-day Mexico City)"},
	{"name":"St Justin", "born":"100", "died":"165", "feast":"Jun-01", "canonized":"Pre-congregation","comments":"He was an early Christian apologist and is regarded as the foremost interpreter of the theory of the Logos in the 2nd century. The First Apology, his most well known text, passionately defends the morality of the Christian life to Roman emperor Antoninus."},
	{"name":"St Kateri Tekakwitha", "born":"1657", "died":"1680", "feast":"Apr-17", "canonized":"2012, by Pope Benedict XVI","comments":"She is known as Lily of the Mohawks, saint who was an Algonquin-Mohawk virgin and laywoman. Known for her virtue of chastity and mortification of the flesh, as well as being shunned by her tribe for her conversion to catholicism. "},
	{"name":"St Lawrence of Brindsi", "born":"1559", "died":"1619", "feast":"Jul-21", "canonized":"1881, by Leo XIII","comments":"He was a priest and a member of the Order of Friars Minor Capuchin. He established Capuchin monastries in modern Germany and Austria, furthering the Counter-Reformation and bringing many Protestants back to the catholic faith."},
	{"name":"St Leo the Great", "born":"400", "died":"461", "feast":"Nov-10", "canonized":"Pre-congregation","comments":"He was an Italian aristocrat and was the first pope to have called 'the Great'. He is perhaps best known for having met the Attila the Hun in 452 and persuading him to turn back from his invasion of Italy. He is also a Doctor of the Church. His 'Tome of Leo' document  contributed immensely in the Council of Chalcedon.  "},
	{"name":"St Louis De Montfort", "born":"1673", "died":"1716", "feast":"Apr-28", "canonized":"1947, by Pope Pius XII","comments":"He was a French priest and Confessor. He is known as a preacher, and wrote numerous books which went on to become classic catholic titles and influenced several popes. His notable works are 'The Secret of Mary' and the 'True Devotion to Mary'. "},
	{"name":"St Lucy", "born":"283", "died":"304", "feast":"Dec-13", "canonized":"Pre-congregation","comments":"She is also known as Saint Lucia , was a young martyr who died during the Diocletianic Persecution. She is one of eight women, who along with Blessed Virgin Mary, are commemorated by name in the Canon of the Mass."},
	{"name":"St Margaret of Scotland", "born":"1045", "died":"1093", "feast":"Nov-16", "canonized":"1250, by Pope Innocent IV","comments":"She was an English princess of the House of Wessex, sometimes called 'The Pearl of Scotland'. She was a pious woman, and among many charitable works she established a ferry across the Firth of Forth for pilgrims travelling to Dunfermline Abbey."},
	{"name":"St Maria Faustina", "born":"1905", "died":"1938", "feast":"Oct-05", "canonized":"2000, by Pope John Paul II","comments":"She was a Polish nun, a mystic and visionary. She reported having visions of Jesus and conversations with him, which she wrote about in her dairy. The Dairy of Saint Maria Faustina: Divine Mercy in my Soul."},
	{"name":"St Maria Goretti", "born":"1890", "died":"1902", "feast":"Jul-06", "canonized":"1950, by Pope Pius XII","comments":"She is an Italian virgin-martyr and she is one of the youngest canonized saints."},
	{"name":"St Martin of Tours", "born":"316", "died":"397", "feast":"Nov-11", "canonized":"Pre-congregation","comments":"He was Bishop of Tours, in Spain. He is a disciple of Hilary of Poitiers, a chief proponent of Trinitarian Christianity. He opposed the Arianism of the imperial Court."},
	{"name":"St Maximilian Kolbe", "born":"1894", "died":"1941", "feast":"Aug-14", "canonized":"1982, by Pope John Paul II","comments":"He was a Polish Conventual Franciscan Friar, who volunteered to die in place of a stranger in the German death camp of Auschwitz. Due to his efforts to promote consecration and entrustment to Mary, he is known as the Apostle of Consecration to Mary."},
	{"name":"St Monica", "born":"331", "died":"387", "feast":"Aug-27", "canonized":"Pre-congregation","comments":"She is also known as Monica of Hippo, was an early Christian Saint and the mother of St Augustine of Hippo. She is remembered and honored for her outstanding Christian virtues, particularly the suffering caused by her husband's adultery and her prayerful life dedicated to the reformation of her son."},
	{"name":"St Nicholas", "born":"270", "died":"343", "feast":"Dec-06", "canonized":"Pre-congregation","comments":"He was a historic 4th-century Greek Bishop of Myra(Demre, part of modern-day Turkey). He had  a reputation for secret gift-giving, such as putting coins in the shoes of those who left them out for him. Defender of Orthodoxy, Wonderworker, Holy Hierarch.  "},
	{"name":"St Oliver Plunkett", "born":"1625", "died":"1681", "feast":"Jul-01", "canonized":"1975, by Pope Paul VI","comments":"He was Archbishop of Armagh and Primate of All Ireland who was the last victim of the Popish Plot. Patron saint for peace and reconciliation in Ireland. "},
	{"name":"St Patrick", "born":"387", "died":"461", "feast":"Mar-17", "canonized":"Pre-congregation","comments":"Bishop of Ireland , knowns as the 'Apostle of Ireland'. When he was about 16 , he was captured by Irish pirates from his home in Great Britain and taken as a slave to Ireland, where he lived for 6 years before escaping and returning to his family. After becoming a cleric, he returned to Ireland and he served as an ordained bishop."},
	{"name":"St Perpetua and Felicity", "born":"2C", "died":"203", "feast":"Mar-07", "canonized":"Pre-congregation","comments":"They are Christian martyrs of the 3rd Century. Perpetua was a married noblewoman; Felicity, a slave imprisoned with her. They were put to death along with others at Carthage in the Roman province of Africa. Saints Felicitas and Perpetua are two of seven women commemorated by name in the second part of the Canon of the Mass. The Blessed Virgin Mary is commemorated in the first part."},
	{"name":"St Peter Canisius", "born":"1521", "died":"1597", "feast":"Dec-21", "canonized":"1925, by Pope Pius XI","comments":"He was an important Jesuit Catholic priest who supported the Catholic faith during the Protestant Reformation in Germany, Austria, Bohemia and Switzerland. He is credited with adding to the Hail Mary the sentence 'Holy Mary, Mother of God, pray for us sinners'. He defended Catholic Mariology in his book 'De Maria Virgine Incomparabili et Dei Genitrice Sacrossancta Libri Quinque'. Doctor of the Church."},
	{"name":"St Peter Damian", "born":"1007", "died":"1073", "feast":"Feb-21", "canonized":"No formal canonization","comments":"He is a saint and was made a Doctor of the Church by Pope Leo XII in 1828. He was a Benedictine monk and cardinal in the circle of Pope Leo IX. Predecessor of Saint Francis of Assisi, Reformer, Confessor."},
	{"name":"St Peter Chrysologus", "born":"380", "died":"450", "feast":"Jul-30", "canonized":"Pre-congregation","comments":"He was Bishop of Ravenna from about 433 until his death. He is known as the 'Doctor of Homilies' for the concise but theologically rich reflections he delivered during his time as the Bishop of Ravenna."},
	{"name":"St Philip Neri", "born":"1515", "died":"1595", "feast":"May-26", "canonized":"1622, by Pope Gregory XV","comments":"He is known as the Apostle of Rome, was an Italian priest noted for founding a society of secular clergy called the Congregtion of the Oratory. He is one of the influential figures of the Counter-Reformation, mainly for converting to personal holiness many of the influential people within the Church itself."},
	{"name":"St Pio of Pietrelcina", "born":"1887", "died":"1968", "feast":"Sep-23", "canonized":"2002, by Pope John Paul II","comments":"He is known as Padre Pio, was a friar, priest , stigmatist and mystic, who joined the Order of Friars of Minor Capuchin. He is famous for bearing the stigmata for most of his life. "},
	{"name":"St Pius V", "born":"1504", "died":"1572", "feast":"Apr-30", "canonized":"1712, by Pope Clement XI","comments":"He was Pope from 1566 to his death in 1572. He is chiefly notable for his role in the Council of Trent, the Counter-Reformation, and the standardization of the Roman rite within the Latin Church. Pius V declared Thomas Aquinas  a Doctor of the Church."},
	{"name":"St Pius X", "born":"1835", "died":"1914", "feast":"Aug-21", "canonized":"1954, by Pius XII","comments":"He was Pope from 1903 to his death in 1914.He is known for vigorously opposing modernist interpretations of Catholic doctrine, promoting traditional devotional practices and orthodox theology."},
	{"name":"St Polycarp", "born":"69", "died":"155", "feast":"Feb-23", "canonized":"Pre-congregation","comments":"He was a 2nd century Christian Bishop of Smyrna, Martyr, Early Church Father. He was a disciple of John and that John had ordained him bishop of Smyrna. With Clement of Rome and Ignatius of Antioch, Polycarp is regarded as one of three chief Apostolic Fathers. The sole surviving work attributed to his authorship is his Letter to the Phillippians; it is first recorded by Irenaeus of Lyons"},
	{"name":"St Robert Bellarmine", "born":"1542", "died":"1621", "feast":"Sep-17", "canonized":"1930, by Pope Pius XI","comments":"He was an Italian Jesuit and a Cardinal of the Catholic Church. He was one of the most important figures in the Counter-Reformation.He is widely remembered for his role in the Giordano Bruno affair and the Galileo affair. Doctor of the Church."},
	{"name":"St Rose of Lima", "born":"1586", "died":"1617", "feast":"Aug-23", "canonized":"1671, by Pope Clement X","comments":"She was a Spanish colonist in Lima, Peru, who became known for both her life of severe asceticism and her care of the needy of the city through her own private efforts. A lay member of the Dominican Order, she was the first person born in the Americas to be canonized by the Catholic Church."},
	{"name":"St Rita of Cascia", "born":"1381", "died":"1457", "feast":"May-22", "canonized":"1900, by Pope Leo XIII","comments":"She was an Italian Augustinian nun, widow, Stigmatist.She was bestowed the title of Patroness of Impossible Causes. She also known to be as patroness for abused wives and heartbroken women."},
	{"name":"St Scholastica", "born":"480", "died":"543", "feast":"Feb-10", "canonized":"Pre-congregation","comments":"Born in Italy, according to a ninth century tradition, she was the twin sister of Benedict of Nursia. She is the foundress of the women's branch of Benedictine Monasticism."},
	{"name":"St Sebastian", "born":"256", "died":"287", "feast":"Jan-20", "canonized":"Pre-congregation","comments":"He was an early martyr, who was killed during Emperor Diocletian's persecution of Christians. He is commonly depicted tied to a post or tree and shot with arrows. Details of his martyrdom were first spoken of by 4th-century bishop Ambrose of Milan in his sermon on Psalm 118."},
	{"name":"St Simeon", "born":"390", "died":"459", "feast":"Sep-01", "canonized":"Pre-congregation","comments":"He was a Syriac ascetic saint who achieved fame for living 37 years on a small platform on top of a pillar near Aleppo in Syria."},
	{"name":"St Stephen", "born":"1C", "died":"34", "feast":"Dec-26", "canonized":"Pre-congregation","comments":"Traditionally venerated as the Protomartyr, according to the Acts of the Apostles, a deacon in the early church at Jerusalem who aroused the enmity of members of various synagogues by his teachings."},
	{"name":"St Teresa of Avila", "born":"1515", "died":"1582", "feast":"Oct-15", "canonized":"1622, by Pope Gregory XV","comments":"She was a prominent Spanish mystic, saint, Carmelite nun, author during the Counter Reformation, and theologian of contemplative life through mental prayer. She was a reformer of the Carmelite Order and is considered to be a founder of the Discalced Carmelites along with John of the Cross."},
	{"name":"St Therese of Lisieux", "born":"1873", "died":"1897", "feast":"Oct-01", "canonized":"1925, by Pope Pius XI","comments":"She is popularly known as 'The Little Flower of Jesus' or simply The Little Flower. She was a French Discalced Carmelite nun. The impact of 'The Story of a Soul' , a collection of her autobiographical manuscripts, printed and distributed a year after her death to an initially very limited audience, was great and she rapidly became one of the most popular saints of the twentieth century. Pope John Paul II declared her the 33rd Doctor of the Church."},
	{"name":"St Thomas Aquinas", "born":"1225", "died":"1274", "feast":"Jan-28", "canonized":"1323, by Pope John XXII","comments":"He was an Italian Dominican friar, who was an immensely influential philosopher, theologian and jurist in the tradition of scholasticism, within which he is also known as the 'Doctor Angelicus' and 'Doctor Communis'. Also honored as a Doctor of the Church. The works for which he is best known are the Summa Theologica and the Summa contra Gentiles. He is distinguished for his eucharistic hymns, which form a part of the Church's liturgy."},
	{"name":"St Thomas Becket", "born":"1118", "died":"1170", "feast":"Dec-29", "canonized":"1173, by Pope Alexander III","comments":"He was Archbishop of Canterbury from 1162 until his murder in 1170. He is venerated as a saint and martyr by Catholic Church. He engaged in conflict with Henry II of England over the rights and privileges of the Church and was murdered by followers of the king in Canterbury Cathedral."},
	{"name":"St Thomas More", "born":"1478", "died":"1535", "feast":"Jun-22", "canonized":"1935, by Pope Pius XI","comments":"He was an English lawyer , social philosopher, author, statesman and noted Renaissance humanist. He was also a councillor to Henry VIII. He opposed the Protestant Reformation, in particular the theology of Martin Luther and William Tyndale. Patron of Statesmen and Politicians. "},
	{"name":"St Timothy", "born":"17", "died":"97", "feast":"Jan-22", "canonized":"Pre-congregation","comments":"He was an early Christian evangelist and the first century bishop of Ephesus. The Apostle Paul met him during his second missionary journey and he became Paul's companion. He is addressed as the recipient of the Epistles to Timothy."},
	{"name":"St Titus", "born":"1C", "died":"96", "feast":"Jan-26", "canonized":"Pre-congregation","comments":"He was a companion and disciple of Paul, mentioned in several of the Pauline epistles including the Epistle to Titus. Bishop of the Island of Crete. Martyr."},
	{"name":"St Valentine", "born":"3C", "died":"269", "feast":"Feb-14", "canonized":"Pre-congregation","comments":"He is widely recognized third-century Roman saint commemorated on Feb 14. He was a holy priest, who with St Marius and his family, assisted the martyrs in the persecution under Claudius II."},
	{"name":"St Vincent de Paul", "born":"1581", "died":"1660", "feast":"Sep-27", "canonized":"1737, by Pope Clement XII","comments":"He was a Catholic priest who dedicated himself to serving the poor. He was renowned for his compassion, humility, and generosity and is known as the 'Great Apostle of Charity'.Founded the 'Ladies of Charity' and a leader of what is now known as the Congregation of the Mission or the 'Vincentians'. "}
	
]