[
    {
        "Name": "St. Albert the Great",
        "Period": "1200 - 1280",
        "Feast": "November 15",
        "Short-Desc": "He was German Dominican friar and a Catholic bishop. He is a patron saint of natural scientists; He was beatified in 1622. He was canonized and proclaimed a Doctor of the Church on December 16, 1931, by Pope Pius XI."
    },
    {
        "Name": "St. Alphonsus Liguori",
        "Period": "1696 - 1787",
        "Feast": "August 1",
        "Short-Desc": "Founder of Redemptorist order. Patron of confessors and moralists.Canonized on May 26, 1839 by Pope Gregory XVI. He defended Mariology in the 18th Century, against the cold rationalism."
    },
    {
        "Name": "St. Ambrose",
        "Period": "340 - 397",
        "Feast": "December 7",
        "Short-Desc": "One of the four traditional Doctors of the Latin Church. Opponent of Arianism in the West. Bishop of Milan."
    },
    {
        "Name": "St. Anselm",
        "Period": " 1033 - 1109",
        "Feast": "April 21",
        "Short-Desc": "Archbishop of Canterbury. Father of Scholatsticism. He was proclaimed a Doctor of the Church in 1720 by Pope Clement XI."
    },
    {
        "Name": "St. Anthony of Padua",
        "Period": " 1195 - 1231",
        "Feast": "June 13",
        "Short-Desc": "Evangelical Doctor;Hammer of Heretic;Professor of Miracles;Franciscan.  He was canonized on May 30th,1232 by Pope Gregory IX."
    },
    {
        "Name": "St. Athanasius",
        "Period": " 297 - 373",
        "Feast": "May 2",
        "Short-Desc": "Bishop of Alexandria. Defender of Trinitarianism against Arianism ; Father of Orthodoxy. 'He became what we are, so that He might make us what He is....'[On The Incarnation of The Word, St. Athanasius, Section 54.3]. "
    },
    {
        "Name": "St. Augustine",
        "Period": " 354 - 430",
        "Feast": "August 28",
        "Short-Desc": " He was bishop of Hippo(modern-day Annaba, Algeria). One of the four traditional Doctors of the Latin Church. Doctor of Grace. Notable works are 'City of God' and 'Confessions'."
    },
    {
        "Name": "St. Basil the Great",
        "Period": " 329 - 379",
        "Feast": "Jan 2",
        "Short-Desc": "Father of monasticism in the East. Bishop of Caesarea Mazaca in Cappadocia, Asia Minor(modern-day Turkey). Defended Nicene Creed against Arianism and the followers of Apollinaris of Laodicea."
    },
    {
        "Name": "St. Bede the Venerable",
        "Period": " 673 - 735",
        "Feast": "May 25",
        "Short-Desc": "Benedictine priest, Father of English history. In 1899, he was made a Doctor of the Church by Pope Leo XIII."
    },
    {
        "Name": "St. Bernard of Clairvaux",
        "Period": " 1090 - 1153",
        "Feast": "August 20",
        "Short-Desc": "He had a reputation for being very intelligent and very holy.His words were so sweet that he came to be known as the Melifluous Doctor. He was proclaimed a saint and a Doctor of the Church in 1830. Popular work : Apologia. Patron saint of candlemakers."
    },
    {
        "Name": "St. Bonaventure",
        "Period": " 1217 - 1274",
        "Feast": "July 14",
        "Short-Desc": "Friar, Bishop,Doctor of the Church. He is known as the 'Seraphic Doctor'. He was canonized in 1484 by Pope Sixtus IV. "
    },
    {
        "Name": "St. Catherine of Siena",
        "Period": " 1347 - 1380",
        "Feast": "April 30",
        "Short-Desc": "She was a tertiary of the Dominican Order and a Scholastic philosopher and theologian. She was proclaimed a Doctor of the Church by Pope Paul VI on 3rd October 1970.Mystic saint."
    },
    {
        "Name": "St. Cyril of Alexandria",
        "Period": " 376 - 444",
        "Feast": "June 27",
        "Short-Desc": "Patriarch of Alexandria from 412 to 444;He was a central figure in the First Council of Ephesus in 431. Opponent of Nestorianism.Made key contributions to Christology."
    },
    {
        "Name": "St. Cyril of Jerusalem",
        "Period": " 315 - 387",
        "Feast": "March 18",
        "Short-Desc": "Bishop and opponent of Arianism in the East. He was declared a Doctor of the Church by Pope Leo XIII. He left important writings documenting the instruction of catechumens and the order of the Mass in his day."
    },
    {
        "Name": "St. Ephraem the Syrian",
        "Period": " 306 - 373",
        "Feast": "January 28",
        "Short-Desc": "Known as Harp of the Holy Spirit; Biblical exegete and ecclesiastical writer. He was a Syriac deacon and a prolific hymnographer. His wide variety of hymns, poems and sermons were works of practical theology for the edification of the church."
    },
    {
        "Name": "St. Francis De Sales",
        "Period": " 1567 - 1622",
        "Feast": "January 24",
        "Short-Desc": "Bishop, leader in Counter- Reformation. Patron of Catholic writers and the Catholic press. He is known also for his work on the topic of 'spiritual direction' and spiritual formation, particularly the Introduction to the Devout Life and the Treatise on the Love of God."
    },
    {
        "Name": "St. Gregory I the Great",
        "Period": " 540 - 604",
        "Feast": "September 3",
        "Short-Desc": "One of the traditional Doctors of the Latin Church. Pope, who defended papal supremacy and worked for clerical and monastic reform. He is the patron saint of musicians, singers, students and teachers."
    },
    {
        "Name": "St. Gregory of Nazianzus",
        "Period": " 330 - 390",
        "Feast": "January 2",
        "Short-Desc": "Archibishop of Constantinople, known as Gregory the Theologian or Gregory Nazianzen. He made significant contribution in the Trinitarian theology. He is also known as Cappadocian Father."
    },
    {
        "Name": "St. Hilary of Poitiers",
        "Period": " 315 - 368",
        "Feast": "January 13",
        "Short-Desc": "Bishop of Poitiers and is a Doctor of the Church.  He is known as Athanasius of the West. Patron saint of  lawyers. His works are Commentarius in Evangelium Matthaei, expositions of the Psalms and his major theological work : 'De Trinitate'. "
    },
    {
        "Name": "St. Isidore of Seville",
        "Period": " 560 - 636",
        "Feast": "April 4",
        "Short-Desc": "Archbishop of Seville for more than three decades. Regarded as the most learned man of his time."
    },
    {
        "Name": "St. Jerome",
        "Period": " 343 - 420",
        "Feast": "September 30",
        "Short-Desc": "One of the traditional Doctors of the Latin Church. Father of biblical science. He is best known for his translation of most of the Bible into Latin (Vulgate). "
    },
    {
        "Name": "St. John Chrysostom",
        "Period": " 347 - 407",
        "Feast": "September 13",
        "Short-Desc": "Archbishop of Constantinople, and he is known for his preaching and public speaking. Among his many exegetical works are  67 homilies on Genesis, 59 on the Psalms , 90 on the Gospel of Mathew, 88 on the Gospel of John and 55 on the Acts of the Apostles. "
    }
]